Repository: vesloguzov/course_validator
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru

source: No response from server.
ru: Нет ответа от сервера

source: Error occurred while video duration check:{}
ru: Во время проверки видео произошла ошибка:{}

source: Can't find video with such id on youtube.
ru: Видео с таким id не надено на Youtube

source: Can't check edx video id: no api
ru: Проверка видео по edx_id не удалась: не определен API

source: No video for this edx_video_id:{}
ru: Видео не найдено для этого edx_video_id

source: Error: didn't get duration from server
ru: Ошибка: длительность видео не получена от сервера

source: Grade
ru: Оценка

source: Special exams
ru: Особые экзамены

source: Advanced Modules
ru: Дополнительные Модули

source: Group
ru: Группа

source: Module
ru: Модуль

source: Cohorts
ru: Когорты

source: Proctoring
ru: Прокторинг

source: Dates
ru: Даты

source: Items visibility by group
ru: Видимость объектов по группам

source: Response types
ru: Тип ответа

source: Video full
ru: Видео(полностью)

source: Section
ru: Раздел

source: Subsection
ru: Подраздел

source: Unit
ru: Блок

source: Problem
ru: Задача

source: Video
ru: Название видео

source: Other
ru: Остальные

source: Api is not set up. Contact your administrator
ru: API не настроено. Свяжитесь с администратором сервера.

source: No source for video '{name}' in '{vertical}'
ru: Для видео '{name}' в '{vertical}' не найден источник

source: Video {} is longer than 3600 secs
ru: Видео {} длиннее 3600 секунд

source: Video name
ru: Название видео

source: Video duration(sum: {})
ru: Длительность видео(суммарно: {})

source: Chapter name
ru: Название главы

source: Chapter summary video time
ru: Суммарное время видео в главе

source: Video short
ru: Видео(кратко)

source: Error occured during weight summation
ru: Во время суммирования весов произошла ошибка

source: Grade name
ru: Название оценки

source: Grade count
ru: Количество оценок

source: Grade kicked
ru: Оценок отбрасывается

source: Grade weight
ru: Вес оценки

source: Tasks weight sum({}) is not equal to 100
ru: Сумма весов оценок равна {}, а не 100

source: Task type '{name}': supposed to be {n1}, found in course {n2}
ru: Тип задач '{name}': должно быть {n1}, найдено в курсе {n2}

source: Task of type '{}' in course, no such task type in grading settings
ru: Тип задач '{} найден в курсе, но не установлена в настройках оценок

source: Group name
ru: Имя группы

source: Group used
ru: Группа используется

source: Module type
ru: Тип модуля

source: Module count
ru: Количество модулей

source: Block '{name}'({cat}) doesn't have any inner blocks or tasks
ru: Блок '{name}'({cat}) не содержит внутри себя других блоков и заданий

source: '{n1}' block has start date {d1}, but his parent '{n2}' has later start date {d2}
ru: Блок '{n1}' запускается {d1}, а его родитель '{n2}' запускается позже {d2}

source: All course release dates are later than {}
ru: Все даты запуска в курсе позднее чем {}

source: All stuff by tomorrow is not published
ru: Весь доступный к завтра материал не опубликован

source: No visible for students stuff by tomorrow
ru: Весь доступный к завтра материал не видим студентам

source: Cohorts are disabled
ru: Когорты отключены

source: Population
ru: Количество людей

source: Available proctoring services
ru: Доступные сервисы прокторинга

source: Not defined
ru: Не опредлено

source: Proctoring Service
ru: Сервис прокторинга

source: Parameter
ru: Параметр

source: Value
ru: Значение

source: Item type
ru: Тип раздела

source: Usual student
ru: Обычный студент

source: Type
ru: Тип

source: Counts
ru: Количество

source: Responses sum
ru: Количество ответов

source: Problems sum
ru: Количество задач

source: Categorized {counted_num} problems out of {problems_num}
ru: Удалось категоризировать {counted_num} проблем из {problems_num}

source: Module name
ru: Имя модуля

source: Exam name
ru: Название экзамена

source: Exam chapter
ru: Глава

source: Start date
ru: Дата старта

source: Duration limit
ru: Время прохождения

source: Due date
ru: Финальный срок

source: Is proctored exam
ru: Экзамен с прокторингом

source: Name
ru: Название

source: Location
ru: Местонахождение

source: Publishing date
ru: Дата публикации

source: Submission start
ru: Дата подачи

source: Submission due
ru: Дата сдачи

source: Peer start
ru: Старт проверки студентами

source: Peer due
ru: Конец проверки студентами

source: Cohorts where visible
ru: Когорты где видим

source: Assessment steps
ru: Шаги оценивания

source: Not published
ru: Не опубликовано

source: Course Validation
ru: Проверка Курса

source: About Course Validation
ru: Про Проверку Курса

source: This tool is designed to check course before publishing. Different inspections and checks are being performed and then the report will be formed, shown to you and saved. Perhaps validation will take a little time.
ru: Этот инструмент сделан для проверки курса перед выпуском. Во время проверки сверяются параметры курса с его содержимым, составляется и сохраняется отчет. Проверка может занять некоторое время

source: Action type
ru: Тип действия

source: Proceed new validation
ru: Выполнить новую проверку

source: Load previous validation
ru: Загрузить предыдущую проверку

source: Validation scenarios
ru: Сценарии проверки

source: Validation
ru: Проверка

source: Load validation
ru: Загрузить проверку

source: Loading in progress, please wait.
ru: Идет загрузка, пожалуйста, подождите.

source: Validate Course
ru: Проверить курс

source: No course root in {}
ru: Нет корня курса среди {}

source: This report was not saved!
ru: Отчет не был сохранен!
